TODO.org
#+TITLE:     Sendpatch
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     fni@xxx.com
#+Time-stamp: <2014-06-06 Fri 12:00>
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t ^:{}

#+PROPERTY:  eval no
#+SETUPFILE: bigblow.setup

* Bugs

** TODO Exit with failure if there is some file missing (!)

Currently, because of it goes on, the diff we review in the email is not
complete. What's committed is well complete, hence not what we reviewed!

* Tasks

** TODO [#A] Add a command-line option to recover last log message

In case the commit failed, to avoid having to retype it all or find and insert
the right message.

** TODO [#A] Add a command-line option to allow showing non-whitespace line changes

... remove it (option =-x -w= of =svn diff=) by default!

Then, the default behavior is to show all changes (even whitespaces ones).

But, Emacs users (which have deleted many trailing whitespaces) could run
~sendpatch~ with that option.

They could even have a ~spw~ alias for calling sendpatch with it.

** TODO [#A] Check that the configuration files are in Unix format

Check it, or convert them if needed.

This is a common source of problems...

** TODO Move to first editing line with if =EDITOR= is =emacsclient=

Run =forward-paragraph= to skip the comments in the header of the patch file.

Solution (for Cygwin emacs-w32): if =EDITOR= = emacsclient, set command to

#+begin_src sh
emacsclient -e "(progn (find-file \"0001-.txt\") (beginning-of-buffer) (forward-paragraph))"
#+end_src

*Problem:* emacsclient does not wait!

** TODO Add ability to add private notes which won't be committed

** TODO Add the ability to make a review

That is, the title should be "review" instead of "patch" (or "diff"), and no
commit should be done.

** TODO Check that related programs are accessible

=makelog=, =makediff=, ... are needed, so we better check that they're in the
=PATH=.

** TODO For Unix systems, use the default =mail= command

** TODO [#C] Add support of Git
