TODO.html
<!-- <xml version="1.0"> -->
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <meta name="generator" content=
  "HTML Tidy for Cygwin (vers 1st September 2004), see www.w3.org" />

  <title>Sendpatch</title>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta name="generator" content="Org-mode" />
  <meta name="author" content="Fabrice Niessen" />
  <link rel="stylesheet" type="text/css" href=
  "http://svn/mc/xxx/org-style/trunk/bigblow/css/bigblow.css" />
  <link rel="stylesheet" type="text/css" href=
  "http://svn/mc/xxx/org-style/trunk/bigblow/css/htmlize.css" />
  <link rel="stylesheet" type="text/css" href="css/bigblow.css" />
  <link rel="stylesheet" type="text/css" href="css/htmlize.css" />
</head>

<body>
  <div id="content">
    <h1 class="title">Sendpatch</h1>

    <div id="outline-container-sec-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> Bugs</h2>

      <div class="outline-text-2" id="text-1"></div>

      <div id="outline-container-sec-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class=
        "todo TODO">TODO</span> Exit with failure if there is some file missing
        (!)</h3>

        <div class="outline-text-3" id="text-1-1">
          <p>Currently, because of it goes on, the diff we review in the email
          is not complete. What’s committed is well complete, hence not what we
          reviewed!</p>
        </div>
      </div>
    </div>

    <div id="outline-container-sec-2" class="outline-2">
      <h2 id="sec-2"><span class="section-number-2">2</span> Tasks</h2>

      <div class="outline-text-2" id="text-2"></div>

      <div id="outline-container-sec-2-1" class="outline-3">
        <h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class=
        "todo TODO">TODO</span> Add a command-line option to recover last log
        message</h3>

        <div class="outline-text-3" id="text-2-1">
          <p>In case the commit failed, to avoid having to retype it all or
          find and insert the right message.</p>
        </div>
      </div>

      <div id="outline-container-sec-2-2" class="outline-3">
        <h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class=
        "todo TODO">TODO</span> Add a command-line option to allow showing
        non-whitespace line changes</h3>

        <div class="outline-text-3" id="text-2-2">
          <p>… remove it (option <code>-x -w</code> of <code>svn diff</code>)
          by default!</p>

          <p>Then, the default behavior is to show all changes (even
          whitespaces ones).</p>

          <p>But, Emacs users (which have deleted many trailing whitespaces)
          could run <code>sendpatch</code> with that option.</p>

          <p>They could even have a <code>spw</code> alias for calling
          sendpatch with it.</p>
        </div>
      </div>

      <div id="outline-container-sec-2-3" class="outline-3">
        <h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class=
        "todo TODO">TODO</span> Check that the configuration files are in Unix
        format</h3>

        <div class="outline-text-3" id="text-2-3">
          <p>Check it, or convert them if needed.</p>

          <p>This is a common source of problems…</p>
        </div>
      </div>

      <div id="outline-container-sec-2-4" class="outline-3">
        <h3 id="sec-2-4"><span class="section-number-3">2.4</span> <span class=
        "todo TODO">TODO</span> Move to first editing line with if
        <code>EDITOR</code> is <code>emacsclient</code></h3>

        <div class="outline-text-3" id="text-2-4">
          <p>Run <code>forward-paragraph</code> to skip the comments in the
          header of the patch file.</p>

          <p>Solution (for Cygwin emacs-w32): if <code>EDITOR</code> =
          emacsclient, set command to</p>

          <div class="org-src-container">
            <pre class="src src-sh">
emacsclient -e <span style=
"color: #008000;">"(progn (find-file \"0001-.txt\") (beginning-of-buffer) (forward-paragraph))"</span>
</pre>
          </div>

          <p><b>Problem:</b> emacsclient does not wait!</p>
        </div>
      </div>

      <div id="outline-container-sec-2-5" class="outline-3">
        <h3 id="sec-2-5"><span class="section-number-3">2.5</span> <span class=
        "todo TODO">TODO</span> Add ability to add private notes which won’t be
        committed</h3>
      </div>

      <div id="outline-container-sec-2-6" class="outline-3">
        <h3 id="sec-2-6"><span class="section-number-3">2.6</span> <span class=
        "todo TODO">TODO</span> Add the ability to make a review</h3>

        <div class="outline-text-3" id="text-2-6">
          <p>That is, the title should be “review” instead of “patch” (or
          “diff”), and no commit should be done.</p>
        </div>
      </div>

      <div id="outline-container-sec-2-7" class="outline-3">
        <h3 id="sec-2-7"><span class="section-number-3">2.7</span> <span class=
        "todo TODO">TODO</span> Check that related programs are accessible</h3>

        <div class="outline-text-3" id="text-2-7">
          <p><code>makelog</code>, <code>makediff</code>, … are needed, so we
          better check that they’re in the <code>PATH</code>.</p>
        </div>
      </div>

      <div id="outline-container-sec-2-8" class="outline-3">
        <h3 id="sec-2-8"><span class="section-number-3">2.8</span> <span class=
        "todo TODO">TODO</span> For Unix systems, use the default
        <code>mail</code> command</h3>
      </div>

      <div id="outline-container-sec-2-9" class="outline-3">
        <h3 id="sec-2-9"><span class="section-number-3">2.9</span> <span class=
        "todo TODO">TODO</span> Add support of Git</h3>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <div id="footer">
      <div id="copyright">
        Copyright © Fabrice Niessen
      </div>
    </div>
  </div>
</body>
</html>
